<h2>Cosy CMS, разработанная на фреймворке kohana 3.3.1</h2>
<p>Под словами &#171;написание cms&#187; &#8212; я понимаю написание базовой основы ,отталкиваясь от которой можно будет написать свой функционал который вам потребуется.</p>


<h1 id="Общиесведения">Общие сведения</h1>
<ul><li>Полное название: Система управления сайтом (Cosy - CMS)
</li><li>Маркетинговое название: "Cosy CMS"
</li><li>Идентификатор: cosy_cms
</li></ul>
<h1 id="Краткоеописание">Краткое описание</h1>
<p>
Система управления сайтом, основанная на фреймворке kohana. Цель - создание безопасной и простой в использовании систему для управления сайтом.<br>
</p>
<p>
Основная фунциональность:
</p>
<ul><li>Административная панель:
<ul><li>Структура сайта:
<ul><li>Создание, редактирование, удаление статических страниц
</li><li>Создание, редактирование, удаление контента
</li></ul></li><li>Добавление, удаление, редактирование заметок
</li><li>Управление пользователями:
<ul><li>Создание пользователя
</li><li>Удаление пользователя
</li><li>Редактирование пользователя
</li><li>Настройка привилегий
</li></ul></li></ul></li></ul>
<ul><li>Авторизация пользователей:
<ul><li>Редактирование данных пользователей
</li></ul></li><li>Регистрация пользователей:
<ul><li>Проверка сложности пароля
</li></ul></li></ul>
<p>
Нефункциональные требования:
</p>
<ul><li>Серверная часть: 
<ul><li>Веб-сервер
</li></ul></li><li>Поддержка сервером модулей PHP версией не ниже 5.2.3
</li><li>Клиентская часть: 
<ul><li>Интернет-браузер
</li></ul></li></ul>